resources/benchmark/synthetic/lb/results/istio-l4-only.txt
NAME                             READY   STATUS    RESTARTS   AGE
service0-5fbfb4558b-6sq4s        2/2     Running   0          11s
service1-6bf79894d8-pv24v        2/2     Running   0          10s
service1-busy-654d9b755f-wpqgx   2/2     Running   0          10s
Running 30s test @ http://10.96.113.144/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 83.364ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 85.335ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 81.955ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 74.160ms, rate sampling interval: 231ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    81.54ms   43.51ms 121.02ms   62.87%
    Req/Sec    12.12      5.03    17.00     85.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  114.30ms
 75.000%  115.33ms
 90.000%  115.97ms
 99.000%  117.18ms
 99.900%  119.36ms
 99.990%  121.09ms
 99.999%  121.09ms
100.000%  121.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      22.687     0.000000            1         1.00
      24.415     0.100000          102         1.11
      24.975     0.200000          205         1.25
      25.567     0.300000          301         1.43
     112.703     0.400000          401         1.67
     114.303     0.500000          510         2.00
     114.495     0.550000          557         2.22
     114.687     0.600000          605         2.50
     114.943     0.650000          666         2.86
     115.135     0.700000          713         3.33
     115.327     0.750000          765         4.00
     115.391     0.775000          777         4.44
     115.519     0.800000          812         5.00
     115.583     0.825000          833         5.71
     115.775     0.850000          870         6.67
     115.839     0.875000          883         8.00
     115.903     0.887500          895         8.89
     115.967     0.900000          910        10.00
     116.031     0.912500          920        11.43
     116.095     0.925000          934        13.33
     116.223     0.937500          946        16.00
     116.223     0.943750          946        17.78
     116.287     0.950000          958        20.00
     116.351     0.956250          962        22.86
     116.479     0.962500          971        26.67
     116.479     0.968750          971        32.00
     116.543     0.971875          976        35.56
     116.607     0.975000          980        40.00
     116.671     0.978125          981        45.71
     116.799     0.981250          985        53.33
     116.991     0.984375          987        64.00
     117.055     0.985938          990        71.11
     117.055     0.987500          990        80.00
     117.183     0.989062          992        91.43
     117.311     0.990625          993       106.67
     117.631     0.992188          996       128.00
     117.631     0.992969          996       142.22
     117.631     0.993750          996       160.00
     118.271     0.994531          997       182.86
     118.527     0.995313          999       213.33
     118.527     0.996094          999       256.00
     118.527     0.996484          999       284.44
     118.527     0.996875          999       320.00
     118.975     0.997266         1000       365.71
     118.975     0.997656         1000       426.67
     119.359     0.998047         1001       512.00
     119.359     0.998242         1001       568.89
     119.359     0.998437         1001       640.00
     119.359     0.998633         1001       731.43
     119.359     0.998828         1001       853.33
     121.087     0.999023         1002      1024.00
     121.087     1.000000         1002          inf
#[Mean    =       81.538, StdDeviation   =       43.507]
#[Max     =      121.024, Total count    =         1002]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.02s, 419.51KB read
Requests/sec:     50.09
Transfer/sec:     13.97KB
Check lines for pod service0-5fbfb4558b-6sq4s
1504
Check lines for pod service1-6bf79894d8-pv24v
564
Check lines for pod service1-busy-654d9b755f-wpqgx
940