resources/benchmark/synthetic/lb/results/istio-locality.txt
NAME                             READY   STATUS    RESTARTS   AGE
service0-5fbfb4558b-hc8sv        2/2     Running   0          11s
service1-6bf79894d8-zpftl        2/2     Running   0          10s
service1-busy-654d9b755f-pvpx9   2/2     Running   0          11s
Running 30s test @ http://10.108.48.222/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 28.990ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 28.649ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 28.853ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 26.371ms, rate sampling interval: 56ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.68ms    1.38ms  30.67ms   76.41%
    Req/Sec    12.43     25.39    72.00     83.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.90ms
 75.000%   27.45ms
 90.000%   28.22ms
 99.000%   29.33ms
 99.900%   30.38ms
 99.990%   30.69ms
 99.999%   30.69ms
100.000%   30.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      21.007     0.000000            1         1.00
      25.151     0.100000          101         1.11
      25.839     0.200000          200         1.25
      26.319     0.300000          298         1.43
      26.655     0.400000          398         1.67
      26.895     0.500000          502         2.00
      26.991     0.550000          547         2.22
      27.087     0.600000          596         2.50
      27.199     0.650000          650         2.86
      27.311     0.700000          695         3.33
      27.455     0.750000          747         4.00
      27.535     0.775000          769         4.44
      27.663     0.800000          794         5.00
      27.823     0.825000          826         5.71
      27.935     0.850000          847         6.67
      28.079     0.875000          872         8.00
      28.143     0.887500          881         8.89
      28.223     0.900000          895        10.00
      28.271     0.912500          908        11.43
      28.383     0.925000          919        13.33
      28.463     0.937500          930        16.00
      28.575     0.943750          938        17.78
      28.623     0.950000          944        20.00
      28.671     0.956250          952        22.86
      28.703     0.962500          956        26.67
      28.767     0.968750          962        32.00
      28.847     0.971875          965        35.56
      28.895     0.975000          968        40.00
      28.911     0.978125          971        45.71
      29.023     0.981250          974        53.33
      29.119     0.984375          977        64.00
      29.199     0.985938          980        71.11
      29.199     0.987500          980        80.00
      29.327     0.989062          982        91.43
      29.439     0.990625          983       106.67
      29.647     0.992188          985       128.00
      29.855     0.992969          986       142.22
      29.855     0.993750          986       160.00
      29.951     0.994531          987       182.86
      30.127     0.995313          988       213.33
      30.207     0.996094          989       256.00
      30.207     0.996484          989       284.44
      30.207     0.996875          989       320.00
      30.223     0.997266          990       365.71
      30.223     0.997656          990       426.67
      30.383     0.998047          991       512.00
      30.383     0.998242          991       568.89
      30.383     0.998437          991       640.00
      30.383     0.998633          991       731.43
      30.383     0.998828          991       853.33
      30.687     0.999023          992      1024.00
      30.687     1.000000          992          inf
#[Mean    =       26.682, StdDeviation   =        1.383]
#[Max     =       30.672, Total count    =          992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1492 requests in 30.02s, 415.25KB read
Requests/sec:     49.69
Transfer/sec:     13.83KB
Check lines for pod service0-5fbfb4558b-hc8sv
1492
Check lines for pod service1-6bf79894d8-zpftl
1492
Check lines for pod service1-busy-654d9b755f-pvpx9
0