resources/benchmark/synthetic/lb/results/istio.txt
NAME                             READY   STATUS    RESTARTS   AGE
service0-5fbfb4558b-t9hx8        2/2     Running   0          11s
service1-6bf79894d8-74hkr        2/2     Running   0          10s
service1-busy-654d9b755f-h8ddh   2/2     Running   0          10s
Running 30s test @ http://10.99.19.49/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 67.170ms, rate sampling interval: 234ms
  Thread calibration: mean lat.: 71.258ms, rate sampling interval: 235ms
  Thread calibration: mean lat.: 69.518ms, rate sampling interval: 234ms
  Thread calibration: mean lat.: 68.345ms, rate sampling interval: 234ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.20ms   45.23ms 146.43ms   54.75%
    Req/Sec    12.23      5.20    17.00     84.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.97ms
 75.000%  116.35ms
 90.000%  117.25ms
 99.000%  127.74ms
 99.900%  137.60ms
 99.990%  146.56ms
 99.999%  146.56ms
100.000%  146.56ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      22.127     0.000000            1         1.00
      25.375     0.100000          101         1.11
      25.983     0.200000          202         1.25
      26.399     0.300000          301         1.43
      26.943     0.400000          400         1.67
      27.967     0.500000          500         2.00
     113.471     0.550000          551         2.22
     115.391     0.600000          604         2.50
     115.839     0.650000          655         2.86
     116.159     0.700000          707         3.33
     116.351     0.750000          751         4.00
     116.543     0.775000          779         4.44
     116.671     0.800000          812         5.00
     116.735     0.825000          826         5.71
     116.927     0.850000          864         6.67
     116.991     0.875000          875         8.00
     117.119     0.887500          888         8.89
     117.247     0.900000          904        10.00
     117.311     0.912500          914        11.43
     117.439     0.925000          927        13.33
     117.567     0.937500          944        16.00
     117.567     0.943750          944        17.78
     117.631     0.950000          952        20.00
     117.759     0.956250          958        22.86
     117.887     0.962500          964        26.67
     118.015     0.968750          968        32.00
     118.079     0.971875          971        35.56
     118.335     0.975000          975        40.00
     118.655     0.978125          978        45.71
     122.303     0.981250          981        53.33
     126.015     0.984375          984        64.00
     126.143     0.985938          985        71.11
     127.167     0.987500          987        80.00
     127.743     0.989062          990        91.43
     127.743     0.990625          990       106.67
     133.759     0.992188          992       128.00
     133.759     0.992969          992       142.22
     135.679     0.993750          993       160.00
     135.807     0.994531          994       182.86
     136.063     0.995313          996       213.33
     136.063     0.996094          996       256.00
     136.063     0.996484          996       284.44
     136.063     0.996875          996       320.00
     136.703     0.997266          997       365.71
     136.703     0.997656          997       426.67
     137.599     0.998047          998       512.00
     137.599     0.998242          998       568.89
     137.599     0.998437          998       640.00
     137.599     0.998633          998       731.43
     137.599     0.998828          998       853.33
     146.559     0.999023          999      1024.00
     146.559     1.000000          999          inf
#[Mean    =       68.204, StdDeviation   =       45.229]
#[Max     =      146.432, Total count    =          999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.02s, 419.27KB read
Requests/sec:     50.09
Transfer/sec:     13.96KB
Check lines for pod service0-5fbfb4558b-t9hx8
1504
Check lines for pod service1-6bf79894d8-74hkr
811
Check lines for pod service1-busy-654d9b755f-h8ddh
693